In [1]:
import numpy as np
import pandas as pd

Create two DataFrames of employees (EmpID, Name, Salary) and stack them vertically using pd.concat().

In [3]:
df1 = pd.DataFrame({
    "EmpID": [101,102,103,104],
    "Name": ["Ram","Sam","Man","Ham"],
    "Salary": [20000,23000,45000,10000],
})

df1

   EmpID Name  Salary
0    101  Ram   20000
1    102  Sam   23000
2    103  Man   45000
3    104  Ham   10000

In [4]:
df2 = pd.DataFrame({
    "EmpID": [106,107,108,109],
    "Name": ["Mar","Mas","Nam","Mah"],
    "Salary": [24000,37000,24500,70000],
})

df2

   EmpID Name  Salary
0    106  Mar   24000
1    107  Mas   37000
2    108  Nam   24500
3    109  Mah   70000

In [6]:
pd.concat((df1,df2))

   EmpID Name  Salary
0    101  Ram   20000
1    102  Sam   23000
2    103  Man   45000
3    104  Ham   10000
0    106  Mar   24000
1    107  Mas   37000
2    108  Nam   24500
3    109  Mah   70000

Merge an Employee DataFrame and a Department DataFrame on Dept_ID.

In [7]:
employees = pd.DataFrame({
    "EmpID": [101, 102, 103, 104, 105, 106],
    "Name": ["Alice", "Bob", "Charlie", "David", "Eva", "Frank"],
    "Dept_ID": [1, 2, 1, 3, 2, 3],
    "Salary": [60000, 55000, 70000, 50000, 65000, 72000]
})

# Department DataFrame
departments = pd.DataFrame({
    "Dept_ID": [1, 2, 3],
    "Dept_Name": ["HR", "Finance", "IT"]
})

In [8]:
employees, departments

(   EmpID     Name  Dept_ID  Salary
 0    101    Alice        1   60000
 1    102      Bob        2   55000
 2    103  Charlie        1   70000
 3    104    David        3   50000
 4    105      Eva        2   65000
 5    106    Frank        3   72000,
    Dept_ID Dept_Name
 0        1        HR
 1        2   Finance
 2        3        IT)

In [9]:
pd.merge(employees, departments, on="Dept_ID")

   EmpID     Name  Dept_ID  Salary Dept_Name
0    101    Alice        1   60000        HR
1    102      Bob        2   55000   Finance
2    103  Charlie        1   70000        HR
3    104    David        3   50000        IT
4    105      Eva        2   65000   Finance
5    106    Frank        3   72000        IT

Group the Employee DataFrame by Dept_ID (or Dept_Name) and calculate the average salary.

In [11]:
employees.groupby("Dept_ID")["Salary"].mean()

Dept_ID
1    65000.0
2    60000.0
3    61000.0
Name: Salary, dtype: float64